In [362]:
import pandas as pd

In [363]:
df = pd.read_csv("Sample - Superstore - Sample - Superstore.csv")

In [364]:
df.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [365]:
df.head(3)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2016-152156,11/8/2016,11/11/2016,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820
2,3,CA-2016-138688,6/12/2016,6/16/2016,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.62,2,0.0,6.8714

In [366]:
df.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [367]:
new_df = df[["Ship Mode", "Country", "Region", "Category", "Discount", "Profit"]]

In [368]:
new_df.head(2)

      Ship Mode        Country Region   Category  Discount    Profit
0  Second Class  United States  South  Furniture       0.0   41.9136
1  Second Class  United States  South  Furniture       0.0  219.5820

In [369]:
new_df['Ship Mode'].value_counts()

Ship Mode
Standard Class    5968
Second Class      1945
First Class       1538
Same Day           543
Name: count, dtype: int64

In [370]:
new_df['Country'].value_counts()

Country
United States    9994
Name: count, dtype: int64

In [371]:
new_df['Region'].value_counts()

Region
West       3203
East       2848
Central    2323
South      1620
Name: count, dtype: int64

In [372]:
new_df['Category'].value_counts()

Category
Office Supplies    6026
Furniture          2121
Technology         1847
Name: count, dtype: int64

In [373]:
df1 = new_df.copy()
df2 = new_df.copy()
df3 = new_df.copy()
df4 = new_df.copy()
df5 = new_df.copy()
df6 = new_df.copy()
df7 = new_df.copy()
df8 = new_df.copy()

In [374]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, OrdinalEncoder

In [375]:
# label encode

In [376]:
le = LabelEncoder()

In [377]:
df1["Category"] = le.fit_transform(df1["Category"])

In [378]:
df1.head(2)

      Ship Mode        Country Region  Category  Discount    Profit
0  Second Class  United States  South         0       0.0   41.9136
1  Second Class  United States  South         0       0.0  219.5820

In [379]:
# ordinal Encoder 
ord = OrdinalEncoder()

In [380]:
df1['Country']  = ord.fit_transform(df1[['Country']])

In [381]:
df1['Country'].value_counts()

Country
0.0    9994
Name: count, dtype: int64

In [382]:
# one hot encoding
ohe = OneHotEncoder(sparse_output=False)

In [383]:
encode = ohe.fit_transform(df1[['Region']])

In [384]:
encode

array([[0., 0., 1., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.],
       ...,
       [0., 0., 0., 1.],
       [0., 0., 0., 1.],
       [0., 0., 0., 1.]], shape=(9994, 4))

In [385]:
df1_new = pd.DataFrame(encode, columns=ohe.get_feature_names_out(['Region']))

In [386]:
df1_new.head()

   Region_Central  Region_East  Region_South  Region_West
0             0.0          0.0           1.0          0.0
1             0.0          0.0           1.0          0.0
2             0.0          0.0           0.0          1.0
3             0.0          0.0           1.0          0.0
4             0.0          0.0           1.0          0.0

In [387]:
df1 = df1.drop('Region', axis=1)

In [388]:
df1_update = pd.concat([df1_new, df1], axis=1)

In [389]:
df1_update.head(2)

,Region_Central,Region_East,Region_South,Region_West,Ship Mode,Country,Category,Discount,Profit
0,0.0,0.0,1.0,0.0,Second Class,0.0,0,0.0,41.9136
1,0.0,0.0,1.0,0.0,Second Class,0.0,0,0.0,219.5820

In [390]:
# create dummay variable

In [391]:
dummy = pd.get_dummies(df1_update['Ship Mode'], drop_first=True).astype('int16')
dummy

      Same Day  Second Class  Standard Class
0            0             1               0
1            0             1               0
2            0             1               0
3            0             0               1
4            0             0               1
...        ...           ...             ...
9989         0             1               0
9990         0             0               1
9991         0             0               1
9992         0             0               1
9993         0             1               0

[9994 rows x 3 columns]

In [392]:
df1_update = df1_update.drop('Ship Mode', axis=1)

In [393]:
df1_update.head(2)

,Region_Central,Region_East,Region_South,Region_West,Country,Category,Discount,Profit
0,0.0,0.0,1.0,0.0,0.0,0,0.0,41.9136
1,0.0,0.0,1.0,0.0,0.0,0,0.0,219.5820

In [394]:
df1 = pd.concat([df1_update, dummy], axis=1)
df1.head()

,Region_Central,Region_East,Region_South,Region_West,Country,Category,Discount,Profit,Same Day,Second Class,Standard Class
0,0.0,0.0,1.0,0.0,0.0,0,0.00,41.9136,0,1,0
1,0.0,0.0,1.0,0.0,0.0,0,0.00,219.5820,0,1,0
2,0.0,0.0,0.0,1.0,0.0,1,0.00,6.8714,0,1,0
3,0.0,0.0,1.0,0.0,0.0,0,0.45,-383.0310,0,0,1
4,0.0,0.0,1.0,0.0,0.0,1,0.20,2.5164,0,0,1

In [395]:
# replace 
df2.head()

        Ship Mode        Country Region         Category  Discount    Profit
0    Second Class  United States  South        Furniture      0.00   41.9136
1    Second Class  United States  South        Furniture      0.00  219.5820
2    Second Class  United States   West  Office Supplies      0.00    6.8714
3  Standard Class  United States  South        Furniture      0.45 -383.0310
4  Standard Class  United States  South  Office Supplies      0.20    2.5164

In [396]:
df2['Ship Mode'].value_counts()

Ship Mode
Standard Class    5968
Second Class      1945
First Class       1538
Same Day           543
Name: count, dtype: int64

In [397]:
df2['Ship Mode'] = df2['Ship Mode'].replace(['Standard Class', 'Second Class', 'First Class', 'Same Day'], [4,2,1,3])

C:\Users\USER\AppData\Local\Temp\ipykernel_13728\3048501215.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df2['Ship Mode'] = df2['Ship Mode'].replace(['Standard Class', 'Second Class', 'First Class', 'Same Day'], [4,2,1,3])

In [398]:
df2['Ship Mode'].value_counts()

Ship Mode
4    5968
2    1945
1    1538
3     543
Name: count, dtype: int64

In [399]:
df2['Region'].value_counts()

Region
West       3203
East       2848
Central    2323
South      1620
Name: count, dtype: int64

In [400]:
df2['Region'] = df2['Region'].replace({'West': 3, 'East': 1, 'South': 2, 'Central':4})

C:\Users\USER\AppData\Local\Temp\ipykernel_13728\508343051.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df2['Region'] = df2['Region'].replace({'West': 3, 'East': 1, 'South': 2, 'Central':4})

In [401]:
df2['Region'].value_counts()

Region
3    3203
1    2848
4    2323
2    1620
Name: count, dtype: int64

In [402]:
# using loop
from pandas.api.types import is_numeric_dtype

In [403]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Ship Mode  9994 non-null   int64
 1   Country    9994 non-null   object
 2   Region     9994 non-null   int64
 3   Category   9994 non-null   object
 4   Discount   9994 non-null   float64
 5   Profit     9994 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 468.6+ KB

In [404]:
for cal in df2.columns:
    if is_numeric_dtype(df2[cal]):
        continue
    else:
        df2[cal] = le.fit_transform(df2[cal])

In [405]:
df2.head(2)

   Ship Mode  Country  Region  Category  Discount    Profit
0          2        0       2         0       0.0   41.9136
1          2        0       2         0       0.0  219.5820

In [406]:
df3.head(2)

      Ship Mode        Country Region   Category  Discount    Profit
0  Second Class  United States  South  Furniture       0.0   41.9136
1  Second Class  United States  South  Furniture       0.0  219.5820

In [407]:
# oedinal encoding
ord = OrdinalEncoder()
from pandas.api.types import is_numeric_dtype

In [408]:
for i in df3.columns:
    if is_numeric_dtype(df3[i]):
        continue
    else:
        df3[i] = le.fit_transform(df3[[i]])

c:\Users\USER\AppData\Local\Programs\Python\Python313\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
c:\Users\USER\AppData\Local\Programs\Python\Python313\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
c:\Users\USER\AppData\Local\Programs\Python\Python313\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
c:\Users\USER\AppData\Local\Programs\Python\Python313\Lib\site-packages\sklearn\preprocessing\_label.py:110: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [409]:
df3.head()

   Ship Mode  Country  Region  Category  Discount    Profit
0          2        0       2         0      0.00   41.9136
1          2        0       2         0      0.00  219.5820
2          2        0       3         1      0.00    6.8714
3          3        0       2         0      0.45 -383.0310
4          3        0       2         1      0.20    2.5164

In [410]:
for i in df4.columns:
    if is_numeric_dtype(df4[i]):
        continue
    else:
        df4[i] = ord.fit_transform(df4[[i]])

In [411]:
df4

      Ship Mode  Country  Region  Category  Discount    Profit
0           2.0      0.0     2.0       0.0      0.00   41.9136
1           2.0      0.0     2.0       0.0      0.00  219.5820
2           2.0      0.0     3.0       1.0      0.00    6.8714
3           3.0      0.0     2.0       0.0      0.45 -383.0310
4           3.0      0.0     2.0       1.0      0.20    2.5164
...         ...      ...     ...       ...       ...       ...
9989        2.0      0.0     2.0       0.0      0.20    4.1028
9990        3.0      0.0     3.0       0.0      0.00   15.6332
9991        3.0      0.0     3.0       2.0      0.20   19.3932
9992        3.0      0.0     3.0       1.0      0.00   13.3200
9993        2.0      0.0     3.0       1.0      0.00   72.9480

[9994 rows x 6 columns]

In [412]:
# one hot encoding

In [413]:
for i in df5.columns:
    if is_numeric_dtype(df5[i]):
        continue
    else:
        df5[i] = ohe.fit_transform(df5[[i]])

In [414]:
df5.head()

   Ship Mode  Country  Region  Category  Discount    Profit
0        0.0      1.0     0.0       1.0      0.00   41.9136
1        0.0      1.0     0.0       1.0      0.00  219.5820
2        0.0      1.0     0.0       0.0      0.00    6.8714
3        0.0      1.0     0.0       1.0      0.45 -383.0310
4        0.0      1.0     0.0       0.0      0.20    2.5164

In [415]:
for i in df6.columns:
    if is_numeric_dtype(df6[i]):
        continue
    else:
        dummy = pd.get_dummies(df6[i], drop_first=True).astype("int64")
        df6.drop([i], axis=1, inplace=True)
        df6 = pd.concat([df6, dummy], axis=1)

In [416]:
df6.head()

,Discount,Profit,Same Day,Second Class,Standard Class,East,South,West,Office Supplies,Technology
0,0.00,41.9136,0,1,0,0,1,0,0,0
1,0.00,219.5820,0,1,0,0,1,0,0,0
2,0.00,6.8714,0,1,0,0,0,1,1,0
3,0.45,-383.0310,0,0,1,0,1,0,0,0
4,0.20,2.5164,0,0,1,0,1,0,1,0

In [417]:
# replace for loop
df7.head(2)

      Ship Mode        Country Region   Category  Discount    Profit
0  Second Class  United States  South  Furniture       0.0   41.9136
1  Second Class  United States  South  Furniture       0.0  219.5820

In [419]:
df7['Ship Mode'].nunique()

4

In [418]:
df7['Ship Mode'].unique()

array(['Second Class', 'Standard Class', 'First Class', 'Same Day'],
      dtype=object)

In [421]:
li = df7['Ship Mode'].unique().tolist()

In [422]:
li

['Second Class', 'Standard Class', 'First Class', 'Same Day']

In [425]:
for i in df7.columns:
    if is_numeric_dtype(df7[i]):
        continue
    else:
        uni = df7[i].nunique()
        li = df7[i].unique().tolist()
        if uni==1:
            df7[i]= df7[i].replace(li,[1])
        elif uni==2:
            df7[i]= df7[i].replace(li,[1,2])
        elif uni==3:
            df7[i]= df7[i].replace(li,[1,2,3])
        elif uni==4:
            df7[i]= df7[i].replace(li,[1,2,3,4])

C:\Users\USER\AppData\Local\Temp\ipykernel_13728\251870729.py:14: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df7[i]= df7[i].replace(li,[1,2,3,4])
C:\Users\USER\AppData\Local\Temp\ipykernel_13728\251870729.py:8: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df7[i]= df7[i].replace(li,[1])
C:\Users\USER\AppData\Local\Temp\ipykernel_13728\251870729.py:12: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df7[i]= df7[i].replace(li,[1,2,3])

In [426]:
df7

      Ship Mode  Country  Region  Category  Discount    Profit
0             1        1       1         1      0.00   41.9136
1             1        1       1         1      0.00  219.5820
2             1        1       2         2      0.00    6.8714
3             2        1       1         1      0.45 -383.0310
4             2        1       1         2      0.20    2.5164
...         ...      ...     ...       ...       ...       ...
9989          1        1       1         1      0.20    4.1028
9990          2        1       2         1      0.00   15.6332
9991          2        1       2         3      0.20   19.3932
9992          2        1       2         2      0.00   13.3200
9993          1        1       2         2      0.00   72.9480

[9994 rows x 6 columns]